interop-mock/src/main/resources/whitemesa/soap12/test-rpc/echoNestedArray-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <ns1:echoNestedArray soapenv:encodingStyle="http://www.w3.org/2003/05/soap-encoding" xmlns:ns1="http://example.org/ts-tests">
         <inputStruct id="id0" xsi:type="ns2:SOAPArrayStruct" xmlns:ns2="http://example.org/ts-tests/xsd">
            <varString xsi:type="xsd:string">EchoNestedArray1</varString>
            <varInt id="id1" xsi:type="xsd:int">10</varInt>
            <varFloat id="id2" xsi:type="xsd:float">-5.0</varFloat>
            <varArray soapenc:itemType="xsd:string" soapenc:arraySize="3" xsi:type="soapenc:Array" xmlns:soapenc="http://www.w3.org/2003/05/soap-encoding">
               <varArray xsi:type="xsd:string">EchoNestedArray2</varArray>
               <varArray xsi:type="xsd:string">EchoNestedArray3</varArray>
               <varArray xsi:type="xsd:string">EchoNestedArray4</varArray>
            </varArray>
         </inputStruct>
      </ns1:echoNestedArray>
   </soapenv:Body>
</soapenv:Envelope>